# Pandas

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
labels = ['a','b','c']
data = [10,20,30]
arr = np.array(data)
dic = {'a':10, 'b':20,'c':30}

In [8]:
labels

['a', 'b', 'c']

In [11]:
pd.Series(data,labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(data= data,index= labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(data=data)

0    10
1    20
2    30
dtype: int64

In [14]:
pd.Series(dic)

a    10
b    20
c    30
dtype: int64

In [16]:
series_country = pd.Series([1,2,3,4],['USA','Germany','Italy','Japan'])

In [17]:
series_country

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [18]:
series_country['USA']

np.int64(1)

# Pandas - DataFrame

In [7]:
from numpy.random import randn

In [50]:
np.random.seed(101)

In [8]:
df = pd.DataFrame(randn(5,4),['A','B','C',"D","E"],["W","X","Y","Z"])

In [25]:
""" This is going to output table with 5 rows and 4 columns , since we used randn the numbers will be positive and negative """
df

          W         X         Y         Z         M         N
A -0.441243 -0.216963 -1.009343 -0.961100 -0.658206 -1.226305
B -0.100829 -0.751099 -0.514862 -0.062873 -0.851928 -1.265961
C -0.213377 -0.322120  1.263857  0.459278 -0.535496  0.941738
D  0.932247 -0.733863 -1.560492 -0.953982  0.198384 -2.294356
E  0.053439  1.052868  0.631852 -0.059761  1.106307  1.684720

In [26]:
df['Y']

A   -1.009343
B   -0.514862
C    1.263857
D   -1.560492
E    0.631852
Name: Y, dtype: float64

In [27]:
type(df['W'])

pandas.core.series.Series

In [28]:
df[['X','W']]

          X         W
A -0.216963 -0.441243
B -0.751099 -0.100829
C -0.322120 -0.213377
D -0.733863  0.932247
E  1.052868  0.053439

In [29]:
df['M'] = df['W'] +df['X']

In [30]:
df

          W         X         Y         Z         M         N
A -0.441243 -0.216963 -1.009343 -0.961100 -0.658206 -1.226305
B -0.100829 -0.751099 -0.514862 -0.062873 -0.851928 -1.265961
C -0.213377 -0.322120  1.263857  0.459278 -0.535496  0.941738
D  0.932247 -0.733863 -1.560492 -0.953982  0.198384 -2.294356
E  0.053439  1.052868  0.631852 -0.059761  1.106307  1.684720

In [31]:
df.M

A   -0.658206
B   -0.851928
C   -0.535496
D    0.198384
E    1.106307
Name: M, dtype: float64

In [32]:
df.Y

A   -1.009343
B   -0.514862
C    1.263857
D   -1.560492
E    0.631852
Name: Y, dtype: float64

In [33]:
df['N'] = df.Y + df.X

In [34]:
df

          W         X         Y         Z         M         N
A -0.441243 -0.216963 -1.009343 -0.961100 -0.658206 -1.226305
B -0.100829 -0.751099 -0.514862 -0.062873 -0.851928 -1.265961
C -0.213377 -0.322120  1.263857  0.459278 -0.535496  0.941738
D  0.932247 -0.733863 -1.560492 -0.953982  0.198384 -2.294356
E  0.053439  1.052868  0.631852 -0.059761  1.106307  1.684720

In [35]:
df.drop('M', axis=1)

          W         X         Y         Z         N
A -0.441243 -0.216963 -1.009343 -0.961100 -1.226305
B -0.100829 -0.751099 -0.514862 -0.062873 -1.265961
C -0.213377 -0.322120  1.263857  0.459278  0.941738
D  0.932247 -0.733863 -1.560492 -0.953982 -2.294356
E  0.053439  1.052868  0.631852 -0.059761  1.684720

In [38]:
df.drop('N',axis=1,inplace=True)

KeyError: "['N'] not found in axis"

In [73]:
df

          W         X         Y         Z         M         N
A  2.706850  0.628133  0.907969  0.503826  3.334983  1.536102
B  0.651118 -0.319318 -0.848077  0.605965  0.331800 -1.167395
C -2.018168  0.740122  0.528813 -0.589001 -1.278046  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177 -1.692109
E  0.190794  1.978757  2.605967  0.683509  2.169552  4.584725

In [74]:
df.drop('M',axis=1, inplace=True)

In [75]:
df

          W         X         Y         Z         N
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [76]:
df.drop('D',axis=0)

          W         X         Y         Z         N
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [77]:
df.shape

(5, 5)

In [ ]:
df.loc['A'] # This will return the information in one row not in column form in oder to return in column use df[''] in rows use df.loc[]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
N    1.536102
Name: A, dtype: float64

In [79]:
type(df.loc['B'])

pandas.core.series.Series

In [83]:
df.iloc[3]

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
N   -1.692109
Name: D, dtype: float64

In [84]:
df.loc['B','W']

np.float64(0.6511179479432686)

In [85]:
df

          W         X         Y         Z         N
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [87]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

# DataFrames - Part 2

In [40]:
import numpy as np

In [41]:
import pandas as pd

In [42]:
from numpy.random import randn

In [43]:
np.random.seed(101)

In [45]:
dataFrame = pd.DataFrame(randn(5,4),["A","B","C","D","E"],["W","X","Y","Z"])

In [46]:
dataFrame

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [47]:
dataFrame.W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [48]:
dataFrame.shape

(5, 4)

In [49]:
dataFrame['N'] = dataFrame.W + dataFrame.X

In [50]:
dataFrame

          W         X         Y         Z         N
A  0.302665  1.693723 -1.706086 -1.159119  1.996388
B -0.134841  0.390528  0.166905  0.184502  0.255687
C  0.807706  0.072960  0.638787  0.329646  0.880666
D -0.497104 -0.754070 -0.943406  0.484752 -1.251174
E -0.116773  1.901755  0.238127  1.996652  1.784981

In [51]:
dataFrame > 0

       W      X      Y      Z      N
A   True   True  False  False   True
B  False   True   True   True   True
C   True   True   True   True   True
D  False  False  False   True  False
E  False   True   True   True   True

In [52]:
dataBool = dataFrame > 0

In [53]:
dataBool

       W      X      Y      Z      N
A   True   True  False  False   True
B  False   True   True   True   True
C   True   True   True   True   True
D  False  False  False   True  False
E  False   True   True   True   True

In [54]:
dataFrame[dataBool]

          W         X         Y         Z         N
A  0.302665  1.693723       NaN       NaN  1.996388
B       NaN  0.390528  0.166905  0.184502  0.255687
C  0.807706  0.072960  0.638787  0.329646  0.880666
D       NaN       NaN       NaN  0.484752       NaN
E       NaN  1.901755  0.238127  1.996652  1.784981

In [55]:
dataFrame[dataFrame.W < 0]

          W         X         Y         Z         N
B -0.134841  0.390528  0.166905  0.184502  0.255687
D -0.497104 -0.754070 -0.943406  0.484752 -1.251174
E -0.116773  1.901755  0.238127  1.996652  1.784981

In [62]:
dataFrame[dataFrame.W > 0]['X']

A    1.693723
C    0.072960
Name: X, dtype: float64

In [59]:
dataFrame[dataFrame.N < 0]

          W        X         Y         Z         N
D -0.497104 -0.75407 -0.943406  0.484752 -1.251174

In [63]:
rlt_w_greater_0 = dataFrame[dataFrame.W > 0]

In [64]:
rlt_w_greater_0

          W         X         Y         Z         N
A  0.302665  1.693723 -1.706086 -1.159119  1.996388
C  0.807706  0.072960  0.638787  0.329646  0.880666

In [70]:
rlt_w_greater_0

          W         X         Y         Z         N
A  0.302665  1.693723 -1.706086 -1.159119  1.996388
C  0.807706  0.072960  0.638787  0.329646  0.880666

In [71]:
dataFrame

          W         X         Y         Z         N
A  0.302665  1.693723 -1.706086 -1.159119  1.996388
B -0.134841  0.390528  0.166905  0.184502  0.255687
C  0.807706  0.072960  0.638787  0.329646  0.880666
D -0.497104 -0.754070 -0.943406  0.484752 -1.251174
E -0.116773  1.901755  0.238127  1.996652  1.784981

In [77]:
boolr = dataFrame.W < 0
rlt = dataFrame[boolr]
columns = ['Y','Z']
rlt[columns]

          Y         Z
B  0.166905  0.184502
D -0.943406  0.484752
E  0.238127  1.996652

In [84]:
dataFrame[dataFrame.Y > 0][['Y','Z']]

          Y         Z
B  0.166905  0.184502
C  0.638787  0.329646
E  0.238127  1.996652

In [85]:
#dataFrame[filter_condition][['column1', 'column2']]

In [88]:
dataFrame[(dataFrame.Y > 0)&(dataFrame.Z >= 1)][['Y','Z']]

          Y         Z
E  0.238127  1.996652

In [90]:
dataFrame[(dataFrame.Y < 0) | (dataFrame.Z <= 1)][['Y','Z']]

          Y         Z
A -1.706086 -1.159119
B  0.166905  0.184502
C  0.638787  0.329646
D -0.943406  0.484752

In [91]:
dataFrame.reset_index()

  index         W         X         Y         Z         N
0     A  0.302665  1.693723 -1.706086 -1.159119  1.996388
1     B -0.134841  0.390528  0.166905  0.184502  0.255687
2     C  0.807706  0.072960  0.638787  0.329646  0.880666
3     D -0.497104 -0.754070 -0.943406  0.484752 -1.251174
4     E -0.116773  1.901755  0.238127  1.996652  1.784981

In [92]:
dataFrame

          W         X         Y         Z         N
A  0.302665  1.693723 -1.706086 -1.159119  1.996388
B -0.134841  0.390528  0.166905  0.184502  0.255687
C  0.807706  0.072960  0.638787  0.329646  0.880666
D -0.497104 -0.754070 -0.943406  0.484752 -1.251174
E -0.116773  1.901755  0.238127  1.996652  1.784981

In [93]:
newid = 'CA NY WY OR CO'.split()

In [94]:
newid

['CA', 'NY', 'WY', 'OR', 'CO']

In [95]:
dataFrame['S'] = newid

In [96]:
dataFrame

          W         X         Y         Z         N   S
A  0.302665  1.693723 -1.706086 -1.159119  1.996388  CA
B -0.134841  0.390528  0.166905  0.184502  0.255687  NY
C  0.807706  0.072960  0.638787  0.329646  0.880666  WY
D -0.497104 -0.754070 -0.943406  0.484752 -1.251174  OR
E -0.116773  1.901755  0.238127  1.996652  1.784981  CO

In [97]:
dataFrame.set_index('S')

           W         X         Y         Z         N
S
CA  0.302665  1.693723 -1.706086 -1.159119  1.996388
NY -0.134841  0.390528  0.166905  0.184502  0.255687
WY  0.807706  0.072960  0.638787  0.329646  0.880666
OR -0.497104 -0.754070 -0.943406  0.484752 -1.251174
CO -0.116773  1.901755  0.238127  1.996652  1.784981

In [98]:
dataFrame

          W         X         Y         Z         N   S
A  0.302665  1.693723 -1.706086 -1.159119  1.996388  CA
B -0.134841  0.390528  0.166905  0.184502  0.255687  NY
C  0.807706  0.072960  0.638787  0.329646  0.880666  WY
D -0.497104 -0.754070 -0.943406  0.484752 -1.251174  OR
E -0.116773  1.901755  0.238127  1.996652  1.784981  CO

# Pandas - DataFram P3

In [99]:
import numpy as np

In [7]:
import pandas as pd

In [8]:
from numpy.random import randn

In [9]:
outside = ["G1","G1","G1","G2","G2","G2"]
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [10]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [11]:
dataFrame = pd.DataFrame(randn(6,2),hier_index,["A","B"])

In [12]:
dataFrame

             A         B
G1 1  0.089387 -0.695323
   2  0.151667 -0.809850
   3 -1.347889  0.531413
G2 1  0.179561 -0.844377
   2 -0.571077 -0.074276
   3 -3.223467  0.860088

In [13]:
dataFrame.loc["G1"]

          A         B
1  0.089387 -0.695323
2  0.151667 -0.809850
3 -1.347889  0.531413

In [14]:
dataFrame.loc["G1"].loc[1]

A    0.089387
B   -0.695323
Name: 1, dtype: float64

In [16]:
dataFrame.loc["G2"].loc[3]

A   -3.223467
B    0.860088
Name: 3, dtype: float64

In [17]:
dataFrame

             A         B
G1 1  0.089387 -0.695323
   2  0.151667 -0.809850
   3 -1.347889  0.531413
G2 1  0.179561 -0.844377
   2 -0.571077 -0.074276
   3 -3.223467  0.860088

In [18]:
dataFrame.index.names

FrozenList([None, None])

In [20]:
dataFrame.index.names = ['Grouping','Index']

In [21]:
dataFrame

                       A         B
Grouping Index
G1       1      0.089387 -0.695323
         2      0.151667 -0.809850
         3     -1.347889  0.531413
G2       1      0.179561 -0.844377
         2     -0.571077 -0.074276
         3     -3.223467  0.860088

In [28]:
dataFrame.loc["G1"].loc[3].B

np.float64(0.5314125580426854)

In [33]:
dataFrame.xs(3,level='Index')

                 A         B
Grouping
G1       -1.347889  0.531413
G2       -3.223467  0.860088

# Missing Data

In [34]:
import numpy as np

In [35]:
import pandas as pd

In [39]:
dic = {"A":[1,2,np.nan],"B":[5,np.nan,np.nan],"C":[1,2,3]}

In [40]:
dic

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [41]:
dataFrame = pd.DataFrame(dic)

In [42]:
dataFrame

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [45]:
dataFrame.dropna(axis=1
                 )

   C
0  1
1  2
2  3

In [ ]:
dataFrame.dropna() # This by default while return the row that has values that are not nan

     A    B  C
0  1.0  5.0  1

In [ ]:
dataFrame.dropna(thresh=2) # 2 here is the number of values that must be returned

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [48]:
dataFrame['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [49]:
dataFrame['A'].fillna(value= dataFrame['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Pandas Group By

In [59]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [60]:
dataFrame = pd.DataFrame(data)

In [61]:
dataFrame

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [62]:
byCompany = dataFrame.groupby('Company')

In [64]:
byCompany

In [69]:
byCompany.median(numeric_only=True)

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [70]:
byCompany.sum(numeric_only=True)

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [73]:
byCompany.sum(numeric_only=True).loc['MSFT']

Sales    464
Name: MSFT, dtype: int64

In [74]:
dataFrame

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [75]:
dataFrame.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000